Autodesk.Revit.DB.SiteLocation.Elevation
The Elevation of the site location.
Since: 2014 UR2

Autodesk.Revit.DB.SiteLocation.WeatherStationName
The name of the weather station at the site location.
Since: 2014 UR2

Autodesk.Revit.DB.SiteLocation.PlaceName
Since: 2013
The place name of the site.

Autodesk.Revit.DB.SiteLocation.TimeZone
Time-zone that contains the site
Remarks:
A property that returns the time zone in which the site resides.
The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.
Set this property directly if for your desired latitude and longitude, Revit's calculation
does not match with the actual time zone for your location.  Note that there are no restrictions
preventing you from setting this to an incorrect value for the site location, and incorrect
times for Solar Studies may result.

Autodesk.Revit.DB.SiteLocation.Longitude
The longitude of the site location.
Remarks:
A property that contains the longitude of the site location.
The value of this property is in radians between +PI and -PI.
When setting this property:
Revit will attempt to match the coordinates to a city it knows about, and if a match is found, will set the
name accordingly.Revit will attempt to automatically adjust the time zone value to match the new Longitude value set using
Autodesk.Revit.DB.SunAndShadowSettings.CalculateTimeZone(System.Double,System.Double). For some boundary
cases, the time zone calculated may not be correct.  You can set the Autodesk.Revit.DB.SiteLocation.TimeZone property directly to the correct
value if necessary.
Revit will attempt to automatically update the weather station associated with the coordinates.

Autodesk.Revit.DB.SiteLocation.Latitude
The latitude of the site location.
Remarks:
A property that contains the latitude of the site location.
The value of this property is in radians between +PI/2 and -PI/2.
When setting this property:
Revit will attempt to match the coordinates to a city it knows about, and if a match is found, will set the
name accordingly.Revit will attempt to automatically adjust the time zone value to match the new Latitude value set using
Autodesk.Revit.DB.SunAndShadowSettings.CalculateTimeZone(System.Double,System.Double). For some boundary
cases, the time zone calculated may not be correct.  You can set the Autodesk.Revit.DB.SiteLocation.TimeZone property directly to the
correct value if necessary.
Revit will attempt to automatically update the weather station associated with the location's coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the value out of the permitted range.

Autodesk.Revit.DB.SiteLocation
Contains the geographical location information for the project's site.
Remarks: Each project may have one site which dictates where in the world the project is
based. On this site there may be several locations of the same project. These are represented
by ProjectLocation objects. The site location object can be found by using the SiteLocation property
on the Document object. The properties of this object can be changed such that it represents any
location on the planet or to a known city. Cities already programmed into Revit can be found
from the Cities property on the Application object.